_protected/controllers/ProblemController.php

     public function actionTable()
    {
        if($_POST){
            $startDT = $_POST['startDT'];
            $endDT = $_POST['endDT'];

            // $jadval = ProblemMonitorings::find()->andFilterWhere(['between', 'date', $startDT,$endDT])->all();
            $jadval = Problem::find()->andFilterWhere(['between', 'date', $startDT,$endDT])->all();
---
SELECT * FROM `problem` WHERE `date` BETWEEN '2020-08-02' AND '2020-08-03'